판다스 임포트

In [115]:
import pandas as pd

read_csv 함수를 사용하여 movies.csv 파일의 데이터를 가져옴

CSV 파일
- Comma Separated Values
- ',' 로 구분되 데이터 형식
- \t 를 구분자로 사용하면 Tab-Separated Values
- 100,000 등의 데이터는 따옴표로 감싸는 식으로 해결
- 필드와 레코드라는 간단한 형식으로 이루어져있음

In [116]:
pd.read_csv("movies.csv")

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

판다스는 csv 파일의 내용을 DataFrame 이라는 객체로 가져온다.
DataFrame
- 판다스가 사용하는 객체
- 다중열의 데이터 셋을 저장함
- 엑셀의 다중 열 테이블과 유사함
- 판다스는 처음 다섯줄과 마지막 다섯줄만 표시함
- CSV의 필드와 인덱스로 구성되어 있음. 모든 필드를 인덱스로 설정할 수 있으나 지정하지 않으면 0부터 시작하는 인덱스를 생성

In [117]:
movies = pd.read_csv("movies.csv", index_col= "Title") # 인덱스로 사용할 필드를 명시적으로 지정해줌.
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

### DataFrame 조작

In [118]:
N = 100

movies.head(N)  # 첫 N개의 행 추출

                                       Rank       Studio       Gross  Year
Title
Avengers: Endgame                         1  Buena Vista  $2,796.30   2019
Avatar                                    2          Fox  $2,789.70   2009
Titanic                                   3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens              4  Buena Vista  $2,068.20   2015
Avengers: Infinity War                    5  Buena Vista  $2,048.40   2018
...                                     ...          ...         ...   ...
The Amazing Spider-Man                   96         Sony    $757.90   2012
The Hunger Games: Mockingjay - Part 1    97    Lionsgate    $755.40   2014
Shrek Forever After                      98   Dreamworks    $752.60   2010
X-Men: Days of Future Past               99          Fox    $747.90   2014
Madagascar 3: Europe's Most Wanted      100   Dreamworks    $746.90   2012

[100 rows x 4 columns]

In [119]:
N = 10
movies.tail(N) # 마지막 N개의행 추출

                              Rank           Studio     Gross  Year
Title
Fun with Dick and Jane         773             Sony  $202.00   2005
Teenage Mutant Ninja Turtles   774         New Line  $202.00   1990
Kindergarten Cop               775        Universal  $202.00   1990
Straight Outta Compton         776        Universal  $201.60   2015
21 Jump Street                 777             Sony  $201.60   2012
Yogi Bear                      778  Warner Brothers  $201.60   2010
Garfield: The Movie            779              Fox  $200.80   2004
Cats & Dogs                    780  Warner Brothers  $200.70   2001
The Hunt for Red October       781        Paramount  $200.50   1990
Valkyrie                       782              MGM  $200.30   2008

In [120]:
a = len(movies) # 행의 개수
b = movies.shape # 행과 열의 개수
c = movies.size # 총 셀 개수
print(a, b, c)
print(type(b))

782 (782, 4) 3128
<class 'tuple'>

In [121]:
movie = movies.iloc[499] # 500번째 데이터 추출, i 번째 location
movie

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

iloc을 사용하여 추출할때 Series라는 새 객체를 반환함

In [122]:
type(movie)

pandas.core.series.Series

In [123]:
movie = movies.loc["101 Dalmatians"]
movie

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

pandas는 위와 같이 인덱스에 중복된 필드를 사용을 허용하지만, 당연히 중복된 값이 있으면 행 추출 속도도 줄어듦.

In [124]:
movies.sort_values(by= "Year", ascending=False) # 정렬. key대신 by사용, ascending은 기본이 True

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019
...,...,...,...,...
The Godfather,604,Paramount,$245.10,1972
The Jungle Book,755,Buena Vista,$205.80,1967
101 Dalmatians,708,Buena Vista,$215.90,1961
Bambi,540,RKO,$267.40,1942
Gone with the Wind,288,MGM,$402.40,1939

In [125]:
movies.sort_values(by= ["Studio", "Year"], ascending=[False, False]) # key를 여러개 지정 가능

                         Rank       Studio     Gross  Year
Title
The Imitation Game        642    Weinstein  $233.60   2014
The Intouchables          265    Weinstein  $426.60   2012
Django Unchained          266    Weinstein  $425.40   2012
Silver Linings Playbook   631    Weinstein  $236.40   2012
The King's Speech         276    Weinstein  $414.20   2010
...                       ...          ...       ...   ...
The Little Mermaid        738  Buena Vista  $211.30   1989
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
The Jungle Book           755  Buena Vista  $205.80   1967
101 Dalmatians            708  Buena Vista  $215.90   1961
The Blair Witch Project   588      Artisan  $248.60   1999

[782 rows x 4 columns]

위의 모든 작업들은 모두 DataFrame 객체를 반환함. 결과를 영구적으로 저장하기전에 올바른지 확인할 때 등 유용

가장많은 수익을 올린 영화가 가장 많은 영화 제작사를 찾으려면?

In [126]:
studios = movies["Studio"] # 인덱스랑 스튜디오만 보임. 단일열을 Series 객체로 추출
# studios = movies[["Studio", "Gross"]] # 이렇게하면 2개의 열과 인덱스 추출. 이 경우엔 DataFrame 객체로 반환
studios
# print(type(studios))

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [127]:
studios.value_counts() # 스튜디오를 기준으로 그루핑해서 개수를 셈

Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Polygram                    2
Orion                       2
SonR                        2
Dimension                   2
Vestron                     1
USA                         1
Lions                       1
Focus                       1
Rela.                       1
CL                          1
Pathe                       1
Artisan                     1
IFC                         1
GrtIndia                    1
RKO                         1
UTV                         1
FUN                         1
FR                          1
Newmarket                   1
China Film Corporation      1
HC                          1
Magn.                       1
Name: Studio, dtype: int64

### 필터링 기능

In [128]:
released_by_universal = movies["Studio"] == "Universal" # Series 객체
released_by_universal

Title
Avengers: Endgame               False
Avatar                          False
Titanic                         False
Star Wars: The Force Awakens    False
Avengers: Infinity War          False
                                ...
Yogi Bear                       False
Garfield: The Movie             False
Cats & Dogs                     False
The Hunt for Red October        False
Valkyrie                        False
Name: Studio, Length: 782, dtype: bool

In [129]:
movies[movies["Studio"] == "Universal"] # DataFrame 객체 반환
movies[released_by_universal].head() # 변수해 할당하여 가독성 높임

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

여러가지 조건으로 필터링 할수 있음

In [130]:
released_in_2015 = movies["Year"] == 2015
movies[released_by_universal & released_in_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [131]:
released_in_2015_and_by_universal = (movies["Year"] == 2015) & (movies["Studio"] == "Universal")
movies[released_in_2015_and_by_universal] # 이렇게 해도 되긴함. 복잡한 조건의 경우엔 이렇게 하는게 나을수도?

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [132]:
movies[released_in_2015|released_by_universal] # 당연히 or도 먹음

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

In [133]:
before_2000 = movies["Year"] < 2000 # 부등호도 조건에 넣을 수 있다.
movies[before_2000]

,Rank,Studio,Gross,Year
Title,,,,
Titanic,3,Paramount,"$2,187.50",1997
Jurassic Park,33,Universal,"$1,029.50",1993
Star Wars: Episode I - The Phantom Menace,35,Fox,"$1,027.00",1999
The Lion King,42,Buena Vista,$968.50,1994
Independence Day,78,Fox,$817.40,1996
...,...,...,...,...
JFK,758,Warner Brothers,$205.40,1991
Patch Adams,772,Universal,$202.30,1998
Teenage Mutant Ninja Turtles,774,New Line,$202.00,1990
Kindergarten Cop,775,Universal,$202.00,1990
The Hunt for Red October,781,Paramount,$200.50,1990

### 데이터 그룹화
어떤 제작사가 제작한 영화의 총 수익이 가장 높은지 알아보려면 어떻게할 까?
Gross 열의 값을 제작사 별로 집계

In [134]:
movies["Gross"].str.replace("$", "", regex=False).str.replace(",", "", regex=False) 
# Gross와 인덱스만을 시리즈로 추출
# 숫자가 아닌 텍스트로 저장되므로 "$"와 "," 를 대체하여 없애버림.

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

In [160]:
# 텍스트에서 float 타입으로 변환
movies["Gross"].str.replace("$", "", regex=False).str.replace(",", "", regex=False).astype(float)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [168]:
# 원본 데이터(movies)의 형식을 바꾸려면 이렇게
movies["Gross"] = movies["Gross"].str.replace("$", "", regex=False).str.replace(",", "", regex=False).astype(float)
# 이미 변환해버려서 다시 str을 못씀
movies

                              Rank           Studio   Gross  Year  Grooss
Title
Avengers: Endgame                1      Buena Vista  2796.3  2019  2796.3
Avatar                           2              Fox  2789.7  2009  2789.7
Titanic                          3        Paramount  2187.5  1997  2187.5
Star Wars: The Force Awakens     4      Buena Vista  2068.2  2015  2068.2
Avengers: Infinity War           5      Buena Vista  2048.4  2018  2048.4
...                            ...              ...     ...   ...     ...
Yogi Bear                      778  Warner Brothers   201.6  2010   201.6
Garfield: The Movie            779              Fox   200.8  2004   200.8
Cats & Dogs                    780  Warner Brothers   200.7  2001   200.7
The Hunt for Red October       781        Paramount   200.5  1990   200.5
Valkyrie                       782              MGM   200.3  2008   200.3

[782 rows x 5 columns]

In [172]:
movies["Gross"].mean() # 평균 집계

439.0308184143222

In [177]:
studios = movies.groupby("Studio") # 스튜디오 기준으로 그루핑. 집계함수를 사용가능
studios["Gross"].count().sort_values(ascending=False) # 각 스튜디오가 몇개인지 샘

In [176]:
studios["Gross"].sum().head() # 스튜디오별로 그루핑, 그로스의 합

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64